//如果想在项目中安装指定名称的包，需要运行如下的命令：
//npm install 包的完整名称
//上述的装包命令，可以简写成如下格式
//npm i 完整的包名称

//初次装包完成后，在项目文件夹下多了一个叫做node_module的文件夹和package-lock.json的配置文件
//其中
//node_modules文件夹用来存放所有已安装到项目中的包。require()导入第三方包时，就是从这个目录中查找并加载包
//package-lock.json配置文件用来记录node_modules目录下的每一个包的下载信息，例如包的名字、版本号、下载地址等

//注意：程序员不要手动修改node_modules或package-lock.json文件中的任何代码，npm包管理工具会自动维护它们

//安装指定版本的包
//通过@符号指定具体的版本
//npm i moment@2.22.2

//包的语义化版本规范
//包的版本号是以“点分十进制”形式进行定义的，总共有三位数字，例如：2.21.0
//其中每一位数字所代表的含义如下：
//第1位数字：大版本
//第2位数字：功能版本
//第3位数字：Bug修复版本
//版本号提升的规则：只要前面的版本号增长了，则后面的版本号归零