//1.小白眼中的前端开发vs实际的前端开发
//小白眼中的前端开发：
//*会写HTML+CSS+JavaScript就会前端开发
//*需要美化页面样式，就拽一个bootstrap过来
//*需要操作DOM或发起Ajax请求，就拽一个jQuery过来
//*需要快速实现页面布局效果，就拽一个Layui过来

//实际的前端开发：
//*模块化（js的模块化、css的模块化、资源的模块化）
//*组件化（复用现有的UI结构、样式、行为）
//*规范化（目录结构的划分、编码规范化、接口规范化、文档规范化、Git分支管理）
//*自动化（自动化构建、自动部署、自动化测试）

//2.什么是前端工程化
//前端工程化是指：在企业级的前端项目开发中，把前端开发所需的工具、技术、流程、经验等进行规范化、标准化
//企业中的Vue项目和React项目，都是基于工程化的方式进行开发的
//好处：前端开发自成体系，有一套标准的开发方案和流程

//3.前端工程化的解决方案
//早期的前端工程化解决方案：
//*grunt（https://www.gruntjs.net）
//*gulp(https://www.gulpjs.cn/)

//目前主流的前端工程化解决方案：
//*webpack(https://www.webpack.com/)
//*parcel(https://zh.parceljs.org/)